[
  {
    "mName": "aLive's Raven Expand",
    "mModified": "2016-04-25 18:33:55",
    "mCreated": "2016-04-25 18:33:55",
    "mSource": "<a href=\"http://imbabuilds.com/lotv-terran/lotv-tvt/tvt-alives-raven-expand/\">ImbaBuilds</a>",
    "mExpansion": "LOTV",
    "mFaction": "TERRAN",
    "mVsFaction": "TERRAN",
    "mNotes": "<html><h2>General Overview</h2>

<p>This fast expansion build uses a lot of scouting in order to stay safe against Reapers and Banshees, getting out enough Marines and the infrastructure needed to defend all sorts of aggression that early-game TvT can have.</p>

<h2>Build Order</h2>
<p>
14 – Supply Depot<br />
15 – Refinery<br />
16 – Barracks<br />
19 – 2nd Refinery<br />
20 – @100% Barracks, start Factory and Orbital Command<br />
Start constant Marine production (up to 3)<br />
24 – @100% Factory, start Starport, Tech lab on Factory, and Reactor on Barracks<br />
27 – @400 Mins, start 2nd Command Center<br />
@100% Starport, swap onto Tech lab and start a Raven, start a Tech lab on Factory<br />
@150 Gas, start Cyclone<br />
Benchmark: When your Raven pops (@3:50ish), you should have 26 SCVs, 5 Marines, 1 Raven, and 1 Cyclone almost done.<br />
</p>
<h2>Scouting</h2>

<p>Figuring out your opponent’s opening so that you can react appropriately when you are performing this build is crucial.  Therefore, it is strongly suggested that you SCV scout around 16 or 17 supply in order to see whether your opponent has opened gas first or not.</p>

<p>If your SCV gets into your opponent’s base and sees a Refinery and a Marine, try and stick around to see what add-ons your opponent is making. A fast Tech lab usually will be swapped off onto the Starport for a fast Banshee.  A fast Reactor can be used to swap off and go for Hellions.  Against Hellion play, build your Command Center and keep your Marines on the high ground.</p>

<p>If you get into your opponent’s base and see multiple Barracks or a Reaper pop out, expect early Reaper harassment. Against Reaper play, build your Command Center and position your Marines on the high ground.  If your opponent commits to multiple Barracks, maintain constant Marine production and get a Hellion from your Factory instead of an initial Tech lab. With a Reactored Hellion follow-up you can seize map control and deal with Reapers quite easily.</p>

<p>If your opponent is opening with an expansion of their own or has mined the same amount of gas as you have, then consider cutting the Raven and going into delayed Cloaked Banshee OR Siege Tank production of your own.  Whichever you choose is personal preference.</p>

<p>When your second Orbital Command finishes and you are still worried about a 1 base play, consider scanning your opponent’s main base.  Against 1 base non-Banshee play, starting Siege Tanks and using your Raven for Turrets is an easy way to stay safe.  Against 1 base Banshee play, position your Cyclone and Raven near your production or mineral line as you start a Viking or two for extra defense.</p>

<h2>Transitions</h2>

<p>Because this build opens with every tech building, this build transitions quite strongly into either Marine/Tank/Medivac or Mech play.</p>

<p>When transitioning into Marine/Tank play, against Mech and 3CC builds you can get away with starting your 3rd Command Center right away and following-up with 2 Barracks with Tech labs (to start Stimpack/Combat Shields), 3 Refineries, and 2 Engineering bays.</p>

<p>Against a player opening straight into Bio play or aggressive Marine/Tank play, however, it is necessary to start a Tech lab on your initial Barracks as soon as possible for a quicker Stimpack.  Then, you can build a 2nd Barracks onto the naked Reactor and start Siege Tank production to take yourself into the midgame. This is followed up by a 3rd Command Center, 1 more Barracks, both Refineries at your natural expansion, and 2 Engineering Bays.  Not having Stimpack completed in time for the inevitable 10ish minute drop play can be a game changer because with Medivacs boosting around your main and natural, it is very easy to get caught out of position and take a lot of damage for free.</p>

<p>Another possible follow-up is going for Mech play. By starting a 3rd Command Center instantly, getting all 4 Refineries, and making 2 more Factories and an Armory, you’ll instantly be at the midgame infrastructure you need.  Be sure to make Vikings for drop defense and start your Siege Tank production as son as possible so that you have a healthy Siege Tank count to defend any early drops/pressure.</p>

<h2>Tips</h2>
<p>
 - <b>Fully read the Scouting section of this build</b> before performing it in a game.  The reactions to scouting information as presented in the Scouting section must be learned before this build is even worth performing in a real game.<br />
 - SCV scout with this build at 16 or 17 supply.<br />
 - Cyclones shut down Banshees hard. However, make sure you have enough energy to Scan an escaping Banshee in order to take advantage of the huge range of the Cyclone’s lock-on ability.<br />
 - Anticipate how many Banshees your opponent is making and either continue to produce Vikings or stop after 1 or 2 for safety.<br />
 - Be sure to transition into your midgame infrastructure as soon as you have successfully defended any 1 base play.<br />
</p>
<h2>Pros and Cons</h2>

<p>This build defends early pressure quite easily, while getting a quick expansion and going into the midgame.  Also, this build is incredibly versatile when it comes to transitions, for opening with a 1/1/1 grants you the freedom to transition into nearly anything.</p>

<p>However, this build requires a lot of scouting in order to be performed effectively. The reactions and transitions you must perform depend entirely on your scouting information and interpretation of your opponent’s build order.</p>

<h2>Favorable Maps</h2>

<p>This build is very strong on maps with smaller cliff ranges that Reapers can jump up, encouraging Banshee play.</p>
<p>
 - Dusk Towers<br />
 - Prion Terraces<br />
 - Lerilak Crest<br />
 - Ruins of Seras<br />
</p>
<h2>Replays</h2>

<p><a href=\"https://www.youtube.com/watch?v=ab74hhlOvDg#t=6m20s\">aLive beating Bbyong with this build during SPL 2016</a></p>

<p><a href=\"http://ggtracker.com/matches/6451978\">aLive’s Raven Expand Tutorial Replay vs a Very Easy AI</a></p>
</html>",
    "mItems": [
      {
        "mCount": 1,
        "mTime": 13,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 18,
        "mUnit": "supply_depot"
      },
      {
        "mCount": 1,
        "mTime": 25,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 38,
        "mUnit": "refinery"
      },
      {
        "mCount": 1,
        "mTime": 40,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 45,
        "mUnit": "barracks"
      },
      {
        "mCount": 1,
        "mTime": 52,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 64,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 65,
        "mUnit": "refinery"
      },
      {
        "mCount": 1,
        "mTime": 76,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 93,
        "mUnit": "marine"
      },
      {
        "mCount": 1,
        "mTime": 96,
        "mUnit": "factory"
      },
      {
        "mCount": 1,
        "mTime": 107,
        "mUnit": "supply_depot"
      },
      {
        "mCount": 1,
        "mTime": 111,
        "mUnit": "marine"
      },
      {
        "mCount": 1,
        "mTime": 118,
        "mUnit": "mule"
      },
      {
        "mCount": 1,
        "mTime": 118,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 129,
        "mUnit": "marine"
      },
      {
        "mCount": 1,
        "mTime": 130,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 141,
        "mUnit": "starport"
      },
      {
        "mCount": 1,
        "mTime": 142,
        "mUnit": "tech_lab"
      },
      {
        "mCount": 1,
        "mTime": 178,
        "mUnit": "command_center"
      },
      {
        "mCount": 1,
        "mTime": 187,
        "mUnit": "raven"
      },
      {
        "mCount": 1,
        "mTime": 190,
        "mUnit": "mule"
      },
      {
        "mCount": 1,
        "mTime": 191,
        "mUnit": "supply_depot"
      },
      {
        "mCount": 1,
        "mTime": 192,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 196,
        "mUnit": "marine"
      },
      {
        "mCount": 1,
        "mTime": 213,
        "mUnit": "marine"
      },
      {
        "mCount": 1,
        "mTime": 213,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 219,
        "mUnit": "supply_depot"
      },
      {
        "mCount": 1,
        "mTime": 219,
        "mUnit": "marine"
      },
      {
        "mCount": 1,
        "mTime": 225,
        "mUnit": "scv"
      }
    ]
  },
  {
    "mName": "ForGG's Marine/Hellbat Timing",
    "mSource": "<a href=\"http://imbabuilds.com/lotv-terran/lotv-tvz/tvz-forggs-marine-hellbat-timing/\">ImbaBuilds</a>",
    "mCreated": "2016-04-27 22:43:25",
    "mModified": "2016-04-27 22:43:25",
    "mExpansion": "LOTV",
    "mFaction": "TERRAN",
    "mVsFaction": "ZERG",
    "mNotes": "<html><h2>General Overview</h2>

<p>This Reaper FE build takes your economy immediately into the midgame while still hitting an early 5 minute Marine Hellbat timing to punish a greedy Zerg.</p>

<h2>Build Order</h2>
<p>
14 – Supply Depot<br />
16 – Barracks<br />
16 – Refinery<br />
19 – @100% Barracks, start Orbital Command and a Reaper<br />
20 – @400 Mins, start 2nd Command Center<br />
22 – @100% Reaper, start Marine<br />
23 – @150 Gas, start Factory, Reactor on Barracks, and 2nd Refinery<br />
@100% 2nd Command Center, start Orbital Command<br />
@100% Factory, swap off onto Reactor, start Starport<br />
Constant Marine/Hellion production<br />
@100 Gas, start Armory<br />
@100% Starport, start Medivac<br />
Push out when your Medivac finishes (@4:15ish) with 6 Hellions, 4 Marines, 1 Medivac, and around 34 SCVs at home. Morph your Hellions into Hellbats before the engagement.<br />
</p>
<h2>Scouting</h2>

<p>SCV scouting is not necessary because your Reaper will be out in time to deal with any early shenanigans. With this Reaper, take map control, spot your opponent’s gas timing(s), and check for a lot of Queens or Roaches. Be on the look-out for a 3rd Hatchery.</p>

<p>With your first Hellions, you can continue to pressure the front and scout your opponent slightly more thoroughly.</p>
<p>
 - If you see a ton of Speedlings, then make sure your Hellion micro is on point. Feel free to pull back to more effectively deal with Speedlings. Keep your Hellions alive so that your later push is stronger.<br />
 - If you see Roaches and only 2 bases, then immediately cut Reactor Hellion production and start making Widow Mines two at a time. Cancel the attack and instead go for a Bunker, 3rd base, and Marauders as you defend.<br />
 - If you see two Evolution Chambers or a 3rd base, then assume your opponent is playing a macro game, and continue with the attack.<br />
</p>
<h2>Transitions</h2>

<p>This build transitions pretty easily into standard Marine/Marauder/Medivac/Mine play, Marine/Tank/Medivac play, and Mech play.</p>

<p>For either the Bio/Mine or Marine/Tank transition, as you are pushing out, instantly start your 3rd Command Center, Tech lab on your Barracks for Stimpack, and 2 Engineering Bays.  It is also strongly suggested that you continue Medivac and Marine production before adding on more Barracks so that you can continue unrelenting drop play and keep your opponent on their half of the map while you are attempting to take your own third and get into your comfortable late-game infrastructure.  When your Engineering Bays finish, be sure to start your Infantry upgrades, all of your Refineries, and throw down up to 5 more Barracks to be able to pump out a 3 base army.</p>

<p>If you are going for Marine/Marauder/Medivac/Mine play, be sure to start a Reactor on your naked Factory and start Widow Mine production (adding a 2nd Factory with a Tech lab for the Widow Mine upgrade once you have later secured your third).</p>

<p>If you are going for a Marine/Tank/Medivac play, be sure to start a Tech lab on your naked Factory and start Siege Tank production (adding a 2nd Factory with a Tech lab once you have later secured your third).</p>

<p>If you are going for a Mech followup, be sure to start your 3rd Command Center, all your Refineries, and 2 more Factories. Get +1 Vehicle Weapons, and start Siege Tanks (and/or Liberators) early to defend any Roach pushes. Use your first push to scout for a likely Roach or Mutalisk followup.</p>

<h2>Tips</h2>
<p>
 - Do NOT over commit with your initial Hellions.  Use them exclusively for scouting purposes in the early game; their true purpose is to bolster your ground army in the actual Marine Hellbat timing attack.<br />
 - Against any all-ins with this build, you must rely on your Bunker placement, SCV control, and scouting it coming.  Be active on the map with your first Hellions so that you know what is coming your way before it gets to your doorstep.<br />
 - Do NOT clump up against Banelings.  Your opponent should not be able to have that many Banelings by the 5 minute attack, but be sure to spread your army and micro appropriately if you see Banelings on the field.<br />
 - Remember to pick up your Marines into the Medivacs and boost away as soon as your army is finally overtaken.  Keeping your opponent on their side of the map while you set up your own 3rd base is crucial.<br />
 - Save at least one scan to kill creep.  As a Zerg, losing your initial midgame creep and a Queen or two spreading it can be devastating for the later stages of the game.<br />
</p>
<h2>Pros and Cons</h2>

<p>This build opens somewhat economically, quickly transitioning into an timing and hitting your opponent with a lot of units at the 5 minute mark before they can even stabilize their third base economy.  It is a very strong build for punishing greedy Zergs.</p>

<p>However, while you are opening with 2 Command Centers, it is definitely not nearly as macro-oriented as a more standard Reactor Hellion 3CC build. If your opponent spots this attack early and overproduces units to defend, you will have to pick up and rely on drop play instead of a large frontal assault to get an advantage.</p>

<h2>Favorable Maps</h2>

<p>This build is strongest on smaller maps so that your opponent has less time to prepare an ample defense.</p>
<p>
Orbital Shipyard<br />
Prion Terraces<br />
Ulrena<br />
Lerilak Crest<br />
</p>
<h2>Replays</h2>

<p><a href=\"http://ggtracker.com/matches/6453020\">Masters League AM example replay</a></p>

<p><a href=\"http://ggtracker.com/matches/6433860\">ForGG’s Marine/Hellbat Timing Tutorial Replay vs a Very Easy AI</a></p>
</html>",
    "mItems": [
      {
        "mCount": 1,
        "mTime": 25,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 39,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 41,
        "mUnit": "barracks"
      },
      {
        "mCount": 1,
        "mTime": 46,
        "mUnit": "refinery"
      },
      {
        "mCount": 1,
        "mTime": 51,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 64,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 76,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 90,
        "mUnit": "reaper"
      },
      {
        "mCount": 1,
        "mTime": 102,
        "mUnit": "command_center"
      },
      {
        "mCount": 1,
        "mTime": 113,
        "mUnit": "supply_depot"
      },
      {
        "mCount": 1,
        "mTime": 115,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 116,
        "mUnit": "mule"
      },
      {
        "mCount": 1,
        "mTime": 122,
        "mUnit": "marine"
      },
      {
        "mCount": 1,
        "mTime": 127,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 130,
        "mUnit": "refinery"
      },
      {
        "mCount": 1,
        "mTime": 138,
        "mUnit": "factory"
      },
      {
        "mCount": 1,
        "mTime": 139,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTarget": "barracks",
        "mTime": 139,
        "mUnit": "reactor"
      },
      {
        "mCount": 1,
        "mTime": 151,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 164,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 176,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 180,
        "mUnit": "mule"
      },
      {
        "mCount": 1,
        "mTime": 188,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 189,
        "mUnit": "starport"
      },
      {
        "mCount": 2,
        "mTime": 191,
        "mUnit": "hellion"
      },
      {
        "mCount": 1,
        "mTime": 196,
        "mUnit": "supply_depot"
      },
      {
        "mCount": 1,
        "mTime": 200,
        "mUnit": "marine"
      },
      {
        "mCount": 1,
        "mTime": 200,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 205,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 205,
        "mUnit": "mule"
      },
      {
        "mCount": 1,
        "mTime": 210,
        "mUnit": "armory"
      },
      {
        "mCount": 1,
        "mTime": 212,
        "mUnit": "scv"
      },
      {
        "mCount": 2,
        "mTime": 214,
        "mUnit": "hellion"
      },
      {
        "mCount": 1,
        "mTime": 220,
        "mUnit": "marine"
      },
      {
        "mCount": 1,
        "mTime": 222,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 225,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 229,
        "mUnit": "medivac"
      },
      {
        "mCount": 1,
        "mTime": 231,
        "mUnit": "supply_depot"
      },
      {
        "mCount": 1,
        "mTime": 234,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 237,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 238,
        "mUnit": "marine"
      },
      {
        "mCount": 2,
        "mTime": 245,
        "mUnit": "hellion"
      },
      {
        "mCount": 1,
        "mTime": 247,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 248,
        "mUnit": "mule"
      },
      {
        "mCount": 1,
        "mTime": 249,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 257,
        "mUnit": "supply_depot"
      },
      {
        "mCount": 1,
        "mTime": 258,
        "mUnit": "tech_lab"
      },
      {
        "mCount": 2,
        "mTime": 267,
        "mUnit": "hellion"
      },
      {
        "mCount": 2,
        "mTime": 268,
        "mUnit": "scv"
      },
      {
        "mCount": 1,
        "mTime": 269,
        "mUnit": "mule"
      },
      {
        "mCount": 1,
        "mTime": 274,
        "mUnit": "supply_depot"
      },
      {
        "mCount": 1,
        "mTime": 279,
        "mUnit": "marine"
      },
      {
        "mCount": 2,
        "mTime": 280,
        "mUnit": "scv"
      }
    ]
  }
]
